In [1]:
import pandas as pd
import seaborn as seaborn
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('agora.csv')
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
x = df.drop('Profit',axis=1) # asix=1 means col, axis = 0 means rows

In [4]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [7]:
y = df['Profit']

In [8]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

# Manual

In [12]:
x['Marketing Spend'] = x['Marketing Spend'] / x['Marketing Spend'].max()

In [14]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617       136897.80  471784.10    Dhaka
1         0.983359       151377.59  443898.53      Ctg
2         0.927985       101145.55  407934.54  Rangpur
3         0.873136       118671.85  383199.62    Dhaka
4         0.859438        91391.77  366168.42  Rangpur

# Min Max Scaler

In [15]:
from sklearn.preprocessing import MinMaxScaler

In [20]:
minmax = MinMaxScaler(feature_range=(0, 3)) #default range 0,1
minmax

MinMaxScaler(feature_range=(0, 3))

In [21]:
df['Marketing Spend'] = minmax.fit_transform(x[['Marketing Spend']])
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         2.077850        0.651744   1.000000    Dhaka  192261.83
1         2.950078        0.761972   0.940893      Ctg  191792.06
2         2.783954        0.379579   0.864664  Rangpur  191050.39
3         2.619409        0.512998   0.812235    Dhaka  182901.99
4         2.578313        0.305328   0.776136  Rangpur  166187.94

In [22]:
df['Administration'] = minmax.fit_transform(x[['Administration']])
df['Transport'] = minmax.fit_transform(x[['Transport']])
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         2.077850        1.955232   3.000000    Dhaka  192261.83
1         2.950078        2.285915   2.822680      Ctg  191792.06
2         2.783954        1.138737   2.593991  Rangpur  191050.39
3         2.619409        1.538995   2.436705    Dhaka  182901.99
4         2.578313        0.915984   2.328407  Rangpur  166187.94

# Standard Scaler

In [23]:
df2 = pd.read_csv('agora.csv')
df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [ ]:
from sklearn.preprocessing import StandardScaler
std = StandardScaler()

# Robust Scaler

In [ ]:
df3 = pd.read_csv('agora.csv')
df3.head()

In [ ]:
from sklearn.preprocessing import RobustScaler
rob = RobustScaler()

# Max Absolute Scaler

In [ ]:
df4 = pd.read_csv('agora.csv')
df4.head()

In [ ]:
from sklearn.preprocessing import MaxAbsScaler
rob = MaxAbsScaler()